Revit 2027 API
DGNExportOptions(DGNExportOptions) Constructor
 Constructs a new instance of DGNExportOptions as a copy of the export options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DGNExportOptions(
	DGNExportOptions option
)
Public Sub New (
	option As DGNExportOptions
)
public:
DGNExportOptions(
	DGNExportOptions^ option
)
new :
        option : DGNExportOptions -> DGNExportOptions
Parameters
option DGNExportOptions
 The options to be copied.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DGNExportOptions Class
DGNExportOptions Overload
Autodesk.Revit.DB Namespace